{
  "info": {
    "introduction": "ECOC跨链进入去中心化交易所介绍",
    "whatIs": "什么是跨链",
    "ccTypes": "跨链类型",
    "how": "跨链的逻辑",
    "example": "使用示例",
    "prosCons": "利与弊",
    "future": "未来计划",
    "title": {
      "introduction": "ECOC跨链进入去中心化交易所介绍",
      "whatIs": "什么是跨链",
      "ccTypes": "跨链类型",
      "how": "跨链的逻辑",
      "example": "使用示例",
      "prosCons": "利与弊",
      "future": "未来计划"
    },
    "body": {
      "introduction": "区块链的价值不仅取决于技术，还取决于其用户数量。随着实际用户数量的增加，系统的价值也会增加。这种增长不仅是线性的，而且是指数级的。这被称为“网络效应”或“梅特卡夫定律”。这就是采用如此重要的原因，也是像以太坊这样的区块链比其他区块链具有更大价值的原因。生态系统越丰富，它带来的可用性（效用）就越多，从而吸引更多的用户。用户越多，对其使用和服务的需求就越大，因此区块链（或任何一般系统）的价值就越大。 问题之一是区块链，由于其性质，正遭受规模及经济的困扰：任何时候用户越多，当前区块的拥塞程度就越高。这给用户和应用程序带来了高昂的运营成本（也就是每笔交易的“gas 成本”）。在某一点之后，去中心化应用程序的使用变得令人望而却步，这导致进一步的采用停止。至少对于以太坊和币安链来说是这样。 另一方面，用户数量少的区块链使用率低。低需求具有非常低的成本，并且未被开发。由于生态系统较小，新用户和开发人员不会被它们吸引。上述解决方案可以使用户、分散的应用程序创建者和区块链（包括拥塞的区块链）受益，最终随着总采用率的增加，整个区块链行业都将受益，那就是跨链",
      "whatIs": "跨链是连接不同区块链的能力。它可以包括资产从区块链1转移到区块链2的能力。交叉链也可以是一个分散的应用程序，可以在两条或更多条链上运行。",
      "ccTypes": "不同的跨链策略。有完全不同的方案。有去中心化的跨链架构。还有集中式交叉链方案或使用托管人的方案。去中心化解决方案速度较慢且成本高昂，但也完全无需信任。包括托管人在内的解决方案可以更快、更具成本效益。作为一个缺点，涉及一些信任。",
      "how": "此应用程序遵循托管人跨链策略。它将生态链与以太坊连接起来，也可以将生态链与任何承载 EVM（以太坊虚拟机）的链连接起来。逻辑如下： 在生态链上持有 ECOC 或任何 ECRC20 资产的用户可以将它们转移到其他链，在其他链上使用他们想要的任何应用程序或将它们转移给其他用户。无论何时（或如果）他们想要，他们都可以将他们再次转回ECOC。步骤如下： 用户在生态链上锁定 ECOC 或 ECRC20 代币。用户在目标链上声明他希望接收资产的公共地址。目标链的gas费用以ECOC支付。-预言机看到生态链上的交易并在目标链上发行等量的包装令牌。对于ECOC，目标链（WECOC）上存在一个包装的代币。-用户不能在生态链上使用原始的 ECOC 或 ECRC20 代币，因为它被锁定。 -用户可以自由使用包装好的代币加入目标链上的生态系统。他们还可以将它们转移给其他用户（公共地址）。-如果新所有者愿意，他们可以销毁（销毁）包装的代币，将他们想要接收的生态链地址声明为锁定资产。-当预言机目睹包装的代币被烧毁时，他们会解锁与声明的生态链地址等量的代币。这一步对接收者是免费的（没有gas费用）。-上述系统确保了所有链（原始链和目标链）中的总流通供应量永远不会超过资产的总供应量。包装的代币从总供应量为零开始。当被包装的代币在流通时，原始代币保持锁定状态，并在被包装的代币销毁后解锁。整个过程没有发生膨胀。 -当然，以上都是普通用户看不到的。为了用户友好，用户可以只使用这个 UI。他选择要转移的代币和金额。以上只是对引擎盖下发生的事情的解释。 作为旁注，可以对除 ECOC 以外的任何资产征收管理费。 ECOC 管理费始终为零。 ECRC20 管理费可以为零或高达 1%（这个上限是硬编码在智能合约中的，任何人都不能更改）。如果管理费设置为非零值，那么它只会影响“进入”，这意味着从原始资产到目标链的转换。解锁（转换为原始代币）始终没有gas 或管理成本。",
      "example": "用户持有 100 个 EFG 代币（一个 ECRC20 代币）。他希望将资产转移到以太坊。他将它们锁定在桥梁智能合约中，还在交易中发送 ECOC 以支付目标链的 gas 成本（以太坊 gas 成本）。他声明他的以太坊公共地址来接收打包的资产。 ECOC/ETH 之间的兑换比例取自信誉良好的去中心化来源（交换应用程序）。对于以太坊链，使用了 WETH/WECOC 的 Uniswap 池。 假设管理费为 0.5%。一个预言机在以太坊链上发出 100X99.5%=99.5 WEFG。 WEFG 是一个 ERC20 代币。用户可以使用以太坊的生态系统加入他希望在以太坊上使用的任何 DeFi 应用程序。例如 Uniswap、SushiSwap、Aave、Compound、Synthetix 等。如果愿意，代币的新所有者可以将 WEFG 转回生态链。例如有人可以燃烧 50 个 WEFG，声明一个生态链公共地址。烧毁后oracle会在ecochain上通知并解锁等量（50 EFG），发送到上述地址。这一步是免费的，用户不存在 ECOC 气体或管理费用。",
      "prosCons": "上述方案的优点是链间转移快，gas成本低，因为转移一步完成。唯一的缺点是它不是完全去信任的（不是完全去中心化的）。",
      "future": "桥接将涉及所有主要连锁。从技术上讲，所有运行 VM（它们有智能合约）的链都可以桥接到 Ecochain。我们优先考虑拥有最高用户的链，从以太坊开始。这是实现生态链资产整个生态系统规模的最快方式。"
    }
  },
  "errors": {
    "nonExistingPair": "无效对",
    "priceOutOfRange": "价格超出范围",
    "unknown": "未知错误"
  }
}
